cats99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
     @kats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @kat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def update
    @kat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @kat = Cat.find(params[:id])